#Запись метро Санкт-Петербурга в файл
def write():
    f = open(r"./Files/SaintPMetro.xlsx", "w")
    f.write("Схема метро Санкт-Петербурга\n")
    f.write("red line\tblue line\tgreen line\tyellow line\tpurple line\n")
    f.write("Девяткино\n"+
        "Гражданский проспект\n"+
        "Академическая\n"+
        "Политехническая\n"+
        "Площадь Мужества\n"+
        "Лесная\n"+
        "Выборгская\n"+
        "Площадь Ленина\n"+
        "Чернышевская\n"+
        "Площадь Восстания\t\tМаяковская\n"+
        "Владимирская\t\t\tДостоевская\n"+
        "Пушкинская\t\t\t\tЗвенигородская\n"+
        "Технологический институт 1\tТехнологический институт 2\n"+
        "Балтийская\n"+
        "Нарвская\n"+
        "Кировский завод\n"+
        "Автово\n"+
        "Ленинский проспект\n"+
        "Проспект Ветеранов\n")
    f.write(
        "\n\tПарнас\n"+
        "\tПроспект Просвещения\n"+
        "\tОзерки\n"+
        "\tУдельная\n"+
        "\tПионерская\n"+
        "\tЧёрная речка\n"+
        "\tПетроградская\n"+
        "\tГорьковская\n"+
        "\tНевский проспект\tГостиный двор\n"+
        "\tСенная площадь\tСпасская\t\tСадовая\n"+
        "Технологический институт 1\tТехнологический институт 2\n"+
        "\tФрунзенская\n"+
        "\tМосковские ворота\n"+
        "\tЭлектросила\n"+
        "\tПарк Победы\n"+
        "\tМосковская\n"+
        "\tЗвёздная\n"+
        "\tКупчино\n")
    f.write("\n\t\tБеговая\n"+
        "\t\tЗенит\n"+
        "\t\tПриморская\n"+
        "\t\tВасилеостровская\n"+
        "\tНевский проспект\tГостиный двор\n"+
        "Площадь Восстания\t\tМаяковская\n"+
        "\t\tПлощадь Александра Невского 1\tПлощадь Александра Невского 2\n"+
        "\t\tЕлизаровская\n"+
        "\t\tЛомоносовская\n"+
        "\t\tПролетарская\n"+
        "\t\tОбухово\n"+
        "\t\tРыбацкое\n")
    f.write("\n\t\t\tГорный институт\n"+
        "\t\t\tТеатральная\n"+
        "\tСенная площадь\t\tСпасская\tСадовая\n"+
        "Владимирская\t\t\tДостоевская\n"+
        "\t\t\tЛиговский проспект\n"+
        "\t\tПлощадь Александра Невского 1\tПлощадь Александра Невского 2\n"+
        "\t\t\tНовочеркасская\n"+
        "\t\t\tЛадожская\n"+
        "\t\t\tПроспект Большевиков\n"+
        "\t\t\tУлица Дыбенко\n")
    f.write("\n\t\t\t\tКомендантский проспект\n"+
        "\t\t\t\tСтарая Деревня\n"+
        "\t\t\t\tКрестовский остров\n"+
        "\t\t\t\tЧкаловская\n"+
        "\t\t\t\tСпортивная\n"+
        "\t\t\t\tАдмиралтейская\n"+
        "\tСенная площадь\t\tСпасская\tСадовая\n"+
        "Пушкинская\t\t\t\tЗвенигородская\n"+
        "\t\t\t\tОбводный канал\n"+
        "\t\t\t\tВолковская\n"+
        "\t\t\t\tБухарестская\n"+
        "\t\t\t\tМеждународная\n"+
        "\t\t\t\tПроспект Славы\n"+
        "\t\t\t\tДунайская\n"+
        "\t\t\t\tШушары\n")
    f.close()
    path = r"./Files/SaintPMetro.xlsx"
    return path 
write()
print("cvx")